# Import Data from CSV

In [33]:
import pandas as pd
df = pd.read_csv('http://bit.ly/drinksbycountry')
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

# Describe Dataset

In [34]:
df.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

# Column Information

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

# Determine If DataFrame or Series

In [36]:
type(df)

pandas.core.frame.DataFrame

# Determine Data Type of a column

In [37]:
df.beer_servings.dtype

dtype('int64')

# Determine # of Rows and Columns in a DataFrame

In [38]:
df.shape

(193, 6)

# Determine Data Type for All Columns in a Dataframe

In [39]:
df.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

# Delete a Column

In [41]:
df = df.drop(['total_litres_of_pure_alcohol'], axis=1)
df

         country  beer_servings  spirit_servings  wine_servings      continent
0    Afghanistan              0                0              0           Asia
1        Albania             89              132             54         Europe
2        Algeria             25                0             14         Africa
3        Andorra            245              138            312         Europe
4         Angola            217               57             45         Africa
..           ...            ...              ...            ...            ...
188    Venezuela            333              100              3  South America
189      Vietnam            111                2              1           Asia
190        Yemen              6                0              0           Asia
191       Zambia             32               19              4         Africa
192     Zimbabwe             64               18              4         Africa

[193 rows x 5 columns]

# Check is there is Null values in head

In [42]:
df.isnull().head()

   country  beer_servings  spirit_servings  wine_servings  continent
0    False          False            False          False      False
1    False          False            False          False      False
2    False          False            False          False      False
3    False          False            False          False      False
4    False          False            False          False      False

# Check Sum of Null Values By Column

In [43]:
df.isnull().sum()

country            0
beer_servings      0
spirit_servings    0
wine_servings      0
continent          0
dtype: int64

# Groupby Continent based on Sum and Drop "total litres"

In [54]:
groupby = df.groupby(['continent']).sum()
groupby

               beer_servings  spirit_servings  wine_servings
continent
Africa                  3258              866            862
Asia                    1630             2677            399
Europe                  8720             5965           6400
North America           3345             3812            564
Oceania                 1435              935            570
South America           2101             1377            749

In [55]:
mean4=df.groupby(['continent']).mean()
mean4

               beer_servings  spirit_servings  wine_servings
continent
Africa             61.471698        16.339623      16.264151
Asia               37.045455        60.840909       9.068182
Europe            193.777778       132.555556     142.222222
North America     145.434783       165.739130      24.521739
Oceania            89.687500        58.437500      35.625000
South America     175.083333       114.750000      62.416667

In [56]:
(df.beer_servings>50.00).head()

0    False
1     True
2    False
3     True
4     True
Name: beer_servings, dtype: bool

In [60]:
gt50 = df.loc[df['beer_servings']>50]
gt50.shape

(114, 5)

In [59]:
mean.to_csv ('meandrink2.csv', index = True, header=True)

NameError: name 'mean' is not defined

In [61]:
mean.drop(['index_col'], axis=1)

NameError: name 'mean' is not defined

In [62]:
mean4=df.groupby(['continent']).mean()

In [63]:
mean4

               beer_servings  spirit_servings  wine_servings
continent
Africa             61.471698        16.339623      16.264151
Asia               37.045455        60.840909       9.068182
Europe            193.777778       132.555556     142.222222
North America     145.434783       165.739130      24.521739
Oceania            89.687500        58.437500      35.625000
South America     175.083333       114.750000      62.416667

In [64]:
mean5 = mean4.reset_index()

In [65]:
mean5

       continent  beer_servings  spirit_servings  wine_servings
0         Africa      61.471698        16.339623      16.264151
1           Asia      37.045455        60.840909       9.068182
2         Europe     193.777778       132.555556     142.222222
3  North America     145.434783       165.739130      24.521739
4        Oceania      89.687500        58.437500      35.625000
5  South America     175.083333       114.750000      62.416667

In [66]:
df.describe()

       beer_servings  spirit_servings  wine_servings
count     193.000000       193.000000     193.000000
mean      106.160622        80.994819      49.450777
std       101.143103        88.284312      79.697598
min         0.000000         0.000000       0.000000
25%        20.000000         4.000000       1.000000
50%        76.000000        56.000000       8.000000
75%       188.000000       128.000000      59.000000
max       376.000000       438.000000     370.000000

# Create Boolean Conditions for Beer, Spirit, Wine Exceeding Average

In [67]:
df["BeerLover"]=(df['beer_servings'] > 100)
df['SpiritLover']=(df['spirit_servings']> 80)
df['WineLover']=(df['wine_servings']> 50)
df.head()

,country,beer_servings,spirit_servings,wine_servings,continent,BeerLover,SpiritLover,WineLover
0,Afghanistan,0,0,0,Asia,False,False,False
1,Albania,89,132,54,Europe,False,True,True
2,Algeria,25,0,14,Africa,False,False,False
3,Andorra,245,138,312,Europe,True,True,True
4,Angola,217,57,45,Africa,True,False,False

In [68]:
df.beer_servings.dtype

dtype('int64')

# Count total number of True/False

In [69]:
df.SpiritLover.value_counts()

False    116
True      77
Name: SpiritLover, dtype: int64

# Isolate Beer Condition to Create Index

In [70]:
beertrue=df['BeerLover']
beertrue

0      False
1      False
2      False
3       True
4       True
       ...
188     True
189     True
190    False
191    False
192    False
Name: BeerLover, Length: 193, dtype: bool

# Create DataFrame to Only Include True Condition for Beer

In [ ]:
beeronly=df[beertrue]
beeronly

# Groupby Beer Condition by Continent

In [1]:
beergb = beeronly.groupby(['continent']).mean()
beergb

NameError: name 'beeronly' is not defined

# Plot Only Binary Conditions

# Isolate a DataFrame Column to a Series

In [ ]:
type(df.continent)

In [ ]:
type(df["beer_servings"])

# Create a new series using concatenate

In [ ]:
df['nationcont'] = df.country+df.continent

In [ ]:
type(df["nationcont"])

In [ ]:
type(df.nationcont)

In [ ]:
df.head()

In [ ]:
df.info()

# Demonstrate the difference Between Inplace =True/False

In [ ]:
df.drop('nationcont', axis=1) #inplace=False

In [ ]:
df.info()

In [ ]:
df.drop('nationcont', axis=1, inplace=True)

# 'Inplace=True' will permanently remove column

In [ ]:
df.info()

# Drop the first five rows of a dataframe

In [2]:
df.drop([0,1,2,3,4], axis=0).head()

NameError: name 'df' is not defined

In [ ]:
df.shape

In [ ]:
df.drop([0,1,2,3,4], axis=0, inplace=True)

In [ ]:
df.shape

# Sort a dataframe column

In [ ]:
df.sort_values('continent', ascending=True).head()

In [ ]:
df.sort_values('beer_servings', ascending = False).head()

In [ ]:
df.sort_values(['wine_servings'], ascending = False)

In [ ]:
df.loc[df['country']=='Lebanon']

In [ ]:
df.loc[[94]]

In [ ]:
df.iloc[[89]]

In [ ]:
df[40:90]

In [ ]:
df['sumal'] = df.beer_servings + df.spirit_servings + df.wine_servings

In [ ]:
df.head()

In [ ]:
df.continent.value_counts()